<template>
  <div class="about">
    <h2>Правила игры.</h2>
    <p>Компьютер задумывает тайное 4-значное число с неповторяющимися цифрами. 
      Игрок делает первую попытку отгадать число. Попытка — это 4-значное число с неповторяющимися цифрами,
       сообщаемое противнику. Противник сообщает в ответ, сколько цифр угадано без совпадения с их позициями в 
       тайном числе (то есть количество коров) и сколько угадано вплоть до позиции в тайном числе 
       (то есть количество быков).</p>
    <p> Например:
    Задумано тайное число «3219».
    Попытка: «2310».
    Результат: две «коровы» (две цифры: «2» и «3» — угаданы на неверных позициях) и один «бык» (одна цифра «1» угадана вплоть до позиции).</p>
    <router-link to="/">На главную</router-link>
  </div>
</template>
